Repository: bragefuglseth/Commit
Catalog: po/*.po
Languages: cs, es, et, fr, gl, hi, hr, pl, pt_br, ru

source: Commit message editor
cs: Editor zpráv commitů
es: Editor de mensajes de confirmación
et: Commit sõnumiredaktor
fr: Éditeur de message de commit
gl: Editor de mensaxes de remisión (de Commit)
hi: Commit संदेश संपादक
hr: Uređivač commit poruka
pl: Edytor wiadomości Commit
pt_br: Editor de mensagens de commit
ru: Редактор сообщений коммитов

source: Title maximum length (in characters)
cs: Maximální délka titulku (ve znacích)
es: Longitud máxima del título (en caracteres)
et: Pealkirja maksimaalne pikkus (tähtedes)
fr: Longueur maximale du titre (en caractères)
gl: Máxima lonxitude de título (en caracteres)
hi: शीर्षक की अधिकतम लंबाई (अक्षरों में)
hr: Maksimalna duljina naslova (broj znakova)
pl: Maksymalna długość tytułu (w znakach)
pt_br: Comprimento máximo do título (em caracteres)
ru: Максимальная длина заголовка (в символах)

source: Body lines maximum length (in characters)
cs: Maximální délka řádků těla (ve znacích)
es: Longitud máxima de las líneas del cuerpo (en caracteres)
et: Põhiteksti maksimaalne pikkus (tähtedes)
fr: Longueur maximale des lignes du corps (en caractères)
gl: Máxima lonxitude de liñas do corpo (en caracteres)
hi: अधिकतम टेक्स्ट लाइन लंबाई (वर्णों में)
hr: Maksimalna duljina redaka teksta (broj znakova)
pt_br: Comprimento máximo das linhas do corpo (em caracteres)
ru: Максимальная длина линий (в символах)

source: Commit is an editor that helps you write better Git and Mercurial commit messages.
cs: Commit je editor, který vám pomůže lépe napsat zprávy commitů v systému Git a Mercurial.
es: Commit es un editor que le ayuda a escribir mejores mensajes de confirmación de Git y Mercurial.
et: Commit on redaktor, mis aitab Sinul kirjutada paremaid Git ja Mercurial commit'i sõnumeid.
fr: Commit est un éditeur qui vous aide à écrire de meilleurs messages de commits pour Git et Mercurial.
gl: Commit é un editor que axuda a escribir mellores mensaxes de remisión (commit) en Git e Mercurial.
hi: Commit एक संपादक है जो आपको बेहतर Git और Mercurial कमिट संदेश लिखने में मदद करता है।
hr: Commit je uređivač koji pomaže pisati bolje commit poruke za Git i Mercurial.
pl: Commit jest edytorem, który pomaga lepiej napisać wiadomości commit w Git i Mercurial
pt_br: Commit é um editor que lhe ajuda a escrever melhores mensagens de commit Git e Mercurial.
ru: Commit - это редактор, который поможет вам лучше писать сообщения коммитов Git и Mercurial.

source: After installing make sure to launch the application and follow the instructions.
cs: Po instalaci nezapomeňte aplikaci spustit a postupujte podle pokynů.
es: Después de la instalación, asegúrese de iniciar la aplicación y seguir las instrucciones.
et: Pärast programmi allalaadimist, käivita rakendus ja järgi juhiseid.
fr: Après l'installation assurez-vous de lancer l'application et de suivre les instructions.
gl: Despois de instalala, asegúrese de lanzar a aplicación e segui-las instrucións.
hi: इंस्टॉल करने के बाद एप्लिकेशन लॉन्च करना सुनिश्चित करें और निर्देशों का पालन करें।
hr: Nakon instaliranja pokreni program i slijedi upute.
pl: Po zainstalowaniu, uruchom aplikacje i postępuj zgodnie z instrukcjami.
pt_br: Após a instalação, certifique-se de iniciar o aplicativo e seguir as instruções.
ru: После установки обязательно запустите приложение и следуйте инструкциям.

source: Commit will pop up automatically when you make a commit in one of your projects. To save your commit message, press the Commit button or the <code>Ctrl+Return</code> shortcut. To abort and dismiss Commit, press the Abort button or the <code>Escape</code> key.
cs: Commit se otevře automaticky, když v jednom ze svých projektů uděláte commit. Pro uložení zprávy commitu stiskněte potvrzovací tlačítko, nebo použijte klávesovou zkratku <code>Ctrl+Return</code>. Pro zrušení commitu stiskněte tlačítko Zrušit, nebo použijte klávesu <code>Escape</code>.
es: Commit aparecerá automáticamente cuando realice un commit en uno de sus proyectos. Para guardar su mensaje del commit, pulse el botón de confirmación o el atajo <code>Ctrl+Retorno</code>. Para cancelar y descartar el commit, pulse el botón Cancelar o la tecla </code>Esc</code>.
et: Commit automaatselt avaneb, kui teed sinu projektile commit'i. Et salvestada commit'i sõnum, vajuta Commit nupule või <code>ctrl+return</code> kiirklahvikombinatsioonile. Et commit'i tühistada, vajuta Tühista nupule või <code>escape</code> klahvile.
gl: Commit iniciarase automáticamente cando fagas unha remisión(commit) a un dos teus proxectos. Para gardar a mensaxe de remisión(commit), prema o botón ou o atallo <code>Ctrl+Return</code>. Para abortar ou desestimar Commit, prema o botón Abortar ou a tecla <code>Escape</code>.
hi: जब आप अपने किसी प्रोजेक्ट के लिए प्रतिबद्धता बनाते हैं तो Commit स्वचालित रूप से पॉप अप हो जाएगा। अपना प्रतिबद्ध संदेश सहेजने के लिए, Commit बटन या <code>Ctrl+Return</code> शॉर्टकट दबाएँ। Commit को निरस्त करने और ख़ारिज करने के लिए, निरस्त करें बटन या <code>Escape</code> कुंजी दबाएँ।
hr: Commit će se automatski pojaviti kad učiniš izmjenu u jednom od svojih projekata. Za spremanje tvoje poruke o izmjeni, pritisni gumb „Commit” ili prečac <code>Ctrl+Return</code>. Za prekidanje i odbacivanje izmjene, pritisni gumb „Prekini” ili tipku <code>Escape</code>.
pl: Commit pojawi się automatycznie, gdy zrobisz commit w jednym swoich projektów. Aby zapisać wiadomość commit, naciśnij przycisk Commit lub kombinacje klawiszy _Ctrl+Return_. Aby przerwać lub odrzucić Commit, wciśnij przycisk Anuluj lub klawisz <code>Escape</code>.
pt_br: O Commit aparecerá automaticamente quando você fizer um commit em um de seus projetos. Para salvar sua mensagem de commit, pressione o botão Commit ou a combinação de teclas <code>Ctrl+Return</code>. Para abortar e dispensar o Commit, pressione o botão Cancelar ou a tecla <code>Escape</code>.
ru: Commit появится автоматически, когда вы сделаете коммит в одном из ваших проектов. Чтобы сохранить сообщение фиксации, нажмите кнопку фиксации или сочетание клавиш <code>Ctrl+Return</code>. Чтобы прервать и закрыть фиксацию, нажмите кнопку «Прервать» или клавишу <code>Escape</code>.

source: Features:
cs: Funkce:
es: Características:
et: Funktsioonid:
fr: Fonctionnalités :
gl: Características:
hi: विशेषताएँ:
hr: Značajke:
pl: Funkcje:
pt_br: Recursos:
ru: Функции:

source: Highlights overflow of the commit title
cs: Zvýraznění překročení délky titulku
es: Destaca el excedente del título de la confirmación
et: Näitab, et ei ületaks commit pealkirja pikkust
fr: Mettre en évidence le trop-plein de caractères du titre de la livraison
gl: Destaca o desbordamento no título da remisión (Commit)
hi: Commit शीर्षक के अतिप्रवाह पर प्रकाश डालता है
hr: Ističe predugačke naslove commit poruka
pt_br: Destaca estouro do título do commit
ru: Выделяет переполнение заголовка коммита

source: Smart body wrapping
cs: Chytré zalamování řádků těla
es: Envoltura del cuerpo inteligente
et: Tark teksti joondamine
fr: Enveloppement intelligent du corps
gl: Envoltura de corpo intelixente
hi: स्मार्ट बॉडी रैपिंग
hr: Pametni prijelom teksta
pt_br: Quebra inteligente do corpo do texto
ru: Умная обертка заголовка

source: Inserts a blank line between title and body
cs: Vložit prázdný řádek mezi titulek a tělo
es: Inserta una línea en blanco entre el título y el cuerpo
et: Lisab tühja rea pealkirja ja kirjelduse vahel
fr: Insère une ligne vierge entre le titre et le corps
gl: Engade unha liña en branco entre o título e o corpo
hi: शीर्षक और मुख्य भाग के बीच एक रिक्त रेखा सम्मिलित करता है
hr: Dodaje prazni redak između naslova i teksta
pl: Wstawia pustą linię między tytułem a rozwinięciem
pt_br: Insere uma linha vazia entre título e corpo
ru: Вставляет пустую строку между заголовком и описанием

source: Comments are readonly and excluded from "Select All"
cs: Komentáře jsou pouze pro čtení a jsou vyloučeny z možnosti "Vybrat vše"
es: Los comentarios son de sólo lectura y se excluyen de "Seleccionar todos"
et: Kommentaarid on ainult lugemiseks ning väljastatud „Vali kõik“est
fr: Les commentaires sont en lecture seule et exclus de « Sélectionner tout »
gl: Os comentarios son de só lectura e excluídos de "Seleccionar Todos"
hi: टिप्पणियाँ केवल पढ़ने के लिए हैं और "सभी चुनें" से बाहर रखी गई हैं
hr: Komentari su samo-za-čitanje i isključeni su iz „Odaberi sve”
pl: Komentarze są tylko do odczytu i wykluczone z opcji "Zaznacz wszystko"
pt_br: Comentários são de somente leitura e excluídos de “Selecionar tudo”
ru: Комментарии доступны только для чтения и исключаются из "Выбрать все"

source: Displays project folder and branch in window header
cs: Zobrazení složky projektu a věteve v záhlaví okna
es: Muestra la carpeta del proyecto y la rama en la cabecera de la ventana
et: Näitab projekti kausta ja haru akna pealkirjas
fr: Affiche le dossier du projet et la branche dans l'en-tête de la fenêtre
gl: Mostra o cartafol do proxecto e a rama na cabeceira da xanela
hi: विंडो हेडर में प्रोजेक्ट फ़ोल्डर और शाखा प्रदर्शित करता है
hr: Prikazuje mapu projekta i granu u zaglavlju prozora
pl: Wyświetla folder projektu i gałąź w nagłówku okna
pt_br: Exibe pastas e branches de projeto no cabeçalho da janela
ru: Отображает папку проекта и ветку в заголовке окна

source: Dark mode support
cs: Podpora tmavého režimu
es: Soporte del modo oscuro
et: Tume teema tugi
fr: Support du mode sombre
gl: Soporta modo escuro
hi: गहरे मोड का समर्थन
hr: Podrška za tamni modus
pl: Obsługa trybu ciemnego
pt_br: Suporte a modo escuro
ru: Поддержка тёмной темы

source: Keyboard navigation and shortcuts
cs: Navigace pomocí klávesnice a zkratek
es: Navegación y atajos del teclado
et: Kiirklahvid ning kiire klaviatuuriga navigeerimine
fr: Navigation et raccourcis clavier
gl: Navegación por teclado e atallos
hi: कीबोर्ड नेविगेशन और शॉर्टकट
hr: Navigacija tipkovnicom i prečaci
pl: Nawigacja i skróty klawiszowe
pt_br: Navegação e atalhos de teclado
ru: Навигация по клавиатуре и ярлыки

source: Undo/Redo support
cs: Podpora akcí Zpět/Znovu
es: Soporte para deshacer/rehacer
et: Undo/Redo tugi
fr: Support de l'historique d'annulation
gl: Soporte de Desfacer/Refacer
hi: पूर्ववत करें/पुनः करें समर्थन
hr: Podrška za Poništi/Ponovi
pl: Obsługa cofania i ponawiania
pt_br: Suporte a desfazer/refazer
ru: Поддержка отмены

source: Emoji picker
cs: Výběr emotikonů
es: Selector de emojis
et: Emoji valija
fr: Sélecteur d'emoji
gl: Selector de Emojis
hi: इमोजी चुनने वाला
hr: Birač emojija
pt_br: Seletor de emojis
ru: Эмодзи сборщик

source: Supports git commit, merge, tag --annotate, add --patch, rebase --interactive
cs: Podporuje zprávy git commit, merge, tag --annotate, add --patch a rebase --interactive
es: Soporta git commit, merge, tag --annotate, add --patch, rebase --interactive
et: „git commit, merge, tag --annotate, add --patch, rebase --interactive“ tugi
fr: Supporte git commit, merge, tag --annotate, add --patch, rebase --interactive
gl: Soporta git commit, merge, tag --annotate, add --patch, rebase --interactive
hi: Git commit, merge, tag --annotate, add --patch, rebase --interactive का समर्थन करता है
hr: Podržava git commit, sjedini, oznaka --annotate, dodaj --patch, presloži --interactive
pl: Obsługuje git commit, merge, tag --anotate, add --patch i rebase --interactive
pt_br: Suporta git commit, merge, tag --annotate, add --patch, rebase --interactive
ru: Поддерживает команды git commit, merge, tag --annotate, add --patch, rebase --interactive

source: Supports Mercurial commit
cs: Podporuje commity Mercurial
es: Soporta confirmación de Mercurial
et: Mercurial commit'i tugi
fr: Supporte les commit Mercurial
gl: Soporta remisión de Mercurial (commit de Mercurial)
hi: Mercurial commit का समर्थन करता है
hr: Podržava Mercurial commit
pl: Wspiera commity Mercurial'a
pt_br: Suporta commit do Mercurial
ru: Поддерживает сообщения коммитов Mercurial

source: Auto capitalize the commit title
cs: Automatické použití velkých písmen v titulku commitu
es: Capitalizar automáticamente el título de la confirmación
et: Automaatne suurtäht commit'i pealkirjas
fr: Mise en majuscule automatique du titre du commit
gl: Mayúsculas e título de remisión/commit automáticos
hi: Commit शीर्षक को स्वतः बड़े अक्षरों में लिखें
hr: Automatski koristi velika slova za naslov commit poruke
pl: Auto kapitalizacja tytułu commitu
pt_br: Capitaliza automaticamente o título do commit
ru: Автоматически использовать заглавные буквы в названии коммита

source: Welcome window with settings and instructions
cs: Uvítací okno s nastavením a pokyny
es: Ventana de bienvenida con la configuración y las instrucciones
et: Avaaken sätete ning juhenditega
fr: Fenêtre de bienvenue avec les paramètres et les instructions
gl: Xanela de benvida con configuración e instrucións
hi: सेटिंग्स और निर्देशों के साथ स्वागत विंडो
hr: Uvodni prozor s postavkama i instrukcijama
pl: Okno powitalne z ustawieniami i instrukcjami
pt_br: Janela de boas-vindas com configurações e instruções
ru: Окно приветствия с настройками и инструкциями

source: Highlight syntax for Git, Mercurial and diffs
cs: Podpora zvýrazňování syntaxe pro Git, Mercurial a diffy
es: Resaltar la sintaxis de Git, Mercurial y diffs
et: Git, Mercurial ja diff'ide süntaksi märkimist
fr: Mise en évidence de la syntaxe pour Git, Mercurial et diffs
gl: Destacado de sintaxe para Git, Mercurial e diffs
hi: Git, Mercurial और diffs के लिए सिंटैक्स हाइलाइट करें
hr: Ističe sintaksu za Git, Mercurial i razlike
pt_br: Realce de sintaxe para git, Mercurial e diffs
ru: Подсветка синтаксиса для Git, Mercurial и различий

source: Main window
cs: Hlavní okno
es: Ventana principal
et: Põhiaken
fr: Fenêtre principale
gl: Xanela principal
hi: मुख्य विंडो
hr: Glavni prozor
pl: Główne okno
pt_br: Janela principal
ru: Главное окно

source: Emoji selector
cs: Výběr emotikonů
es: Selector de emojis
et: Emoji valija
fr: Sélecteur d'emoji
gl: Selector de Emojis
hi: इमोजी चयनकर्ता
hr: Birač emojija
pt_br: Seletor de emojis
ru: Селектор Эмодзи

source: Shortcuts
cs: Klávesové zkratky
es: Atajos
et: Kiirklahvid
fr: Raccourcis
gl: Atallos
hi: शॉर्टकट्स
hr: Prečaci
pl: Skróty klawiszowe
pt_br: Atalhos
ru: Ярлыки

source: Welcome window
cs: Uvítací okno
es: Ventana de bienvenida
et: Avaaken
fr: Fenêtre de bienvenue
gl: Xanela de benvida
hi: स्वागत विंडो
hr: Uvodni prozor
pl: Okno powitalne
pt_br: Janela de boas-vindas
ru: Приветственное окно

source: Resize the window to disable auto formatting
et: Muuda akna suurust, et lülitada automaatne vormistus välja
hi: स्वतः स्वरूपण अक्षम करने के लिए विंडो का आकार बदला
hr: Promjena veličine prozora isključuje automatsko formatiranje
ru: Измените размер окна, чтобы отключить автоматическое форматирование

source: Add a theme switcher
et: Lisatud teema lüliti
hi: थीम स्विचर जोड़ा गया
hr: Dodan preklopnik za teme
pl: Dodano przełącznik motywów
ru: Добавить переключатель тем

source: Improve dark mode support
et: Tume teema toe parandused
hi: बेहतर गहरे मोड का समर्थन
hr: Poboljšana podrška za tamni modus
pl: Poprawiono wsparcie dla ciemnego motywu
ru: Улучшить поддержку тёмного режима

source: Support numpad enter
et: Numpad sisestaja tugi
hi: नमपैड एंटर का समर्थन करता है
hr: Podrška za unos numeričkim dijelom tipkovnice
ru: Поддержка цифровой клавиатуры

source: Add mnemonics for buttons
et: Nuppudele mnemoonika
hi: बटनों के लिए निमोनिक्स जोड़ा गया
hr: Dodana mnemonika za gumbe
ru: Добавить мнемоники для кнопок

source: Fix capitalization when amending
et: Suurtähtede kasutuse parandused
hi: संशोधन करते समय पूंजीकरण को ठीक करता है
hr: Ispravljena upotreba velkih slova pri nadodavanju
pl: Naprawiono kapitalizację podczas amendowania
ru: Исправить заглавные буквы при изменении

source: Improve auto capitalization
cs: Vylepšeno automatické použití velkých písmen
es: Mejorar mayúsculas automáticas
et: Automaatne suurtähtede kasutuse parandused
hi: बेहतर स्वचालित पूंजीकरण
hr: Poboljšana automatska upotreba velikih slova
pl: Poprawiono automatyczną kapitalizację
pt_br: Melhora a capitalização automática
ru: Улучшить автоматическую капитализацию

source: Add support for gitconfig and hgrc
cs: Přidána podpora pro gitconfig a hgrc
es: Añade soporte para gitconfig y hgrc
et: gitconfig ja hgrc tugi
hi: gitconfig और hgrc के लिए समर्थन जोड़ा गया
hr: Dodana podrška za gitconfig i hgrc
pl: Dodano wsparcie dla gitconfig i hgrc
pt_br: Adiciona suporte a gitconfig e hgrc
ru: Добавлена поддержка gitconfig и hgrc

source: Support editing any file
cs: Podpora upravovat jakýkoli soubor
es: Soporte para editar cualquier archivo
et: Iga faili redigeerimis tugi
hi: किसी भी फाइल को संपादित करने का समर्थन करता है
hr: Podrška za uređivanje bilo koje datoteke
pl: Wsparcie edycji dowolnego pliku
pt_br: Suporte para modificar quaisquer arquivos
ru: Поддержка редактирования любого файла

source: Make the primary button label dynamic (Tag, Rebase, Commit, ...)
cs: Štítek potvrzovacího tlačítka je nyní dynamický (Vytvořit štítek, Změnit základ, Commit, …)
et: Dünaamiliseks tehtud peamise nupu silt (Rebase, Commit jne)
hi: प्राथमिक बटन लेबल को गतिशील बनाया (टैग, रीबेस, कमिट, ...)
hr: Oznaka primarnog gumba postavljena dinamičnom (oznaka, presloži, commit, ...)
ru: Сделать метку основной кнопки динамической (Tag, Rebase, Commit,...)

source: Use 2 spaces indentation
cs: Použití 2 mezer pro odsazení
et: Kahe tühiku kasutamine taandes
hi: 2 रिक्त स्थान इंडेंटेशन का उपयोग करता है
hr: Koristi 2 znaka razmaka za uvlaku
ru: Использовать отступ в 2 пробела

source: Add menu button
cs: Přidáno tlačítko menu
et: Menüü nupu lisamine
hi: मेनू बटन जोड़ा गया
hr: Dodan gumb izbornika
pl: Dodano przycisk menu
ru: Добавить кнопку меню

source: GNOME Platform 42
cs: Platforma GNOME 42
et: GNOME platvorm 42
fr: Plateforme GNOME 42
gl: Plataforma GNOME 42
hi: GNOME प्लेटफार्म 42
hr: GNOME platforma 42
ru: Платформа GNOME 42

source: Various fixes
cs: Různé opravy
es: Varias correcciones
et: Veaparandused
fr: Diverses corrections
gl: Varias reparacións
hi: विभिन्न सुधार
hr: Razni ispravci
pl: Różne poprawek
pt_br: Várias correções
ru: Различные исправления

source: Add keyboard shortcuts for moving lines up and down
cs: Přidány klávesové zkratky pro přesouvání řádků nahoru a dolů
es: Añadir atajos del teclado para mover las líneas hacia arriba y hacia abajo
et: Kiirklahvid rea liigutamiseks üles või alla
fr: Ajout de raccourcis clavier pour déplacer les lignes vers le haut et le bas
gl: Engadir atallos de teclado para mover liñas arriba e abaixo
hi: लाइनों को ऊपर और नीचे ले जाने के लिए कीबोर्ड शॉर्टकट जोड़े गए
hr: Dodani tipkovni prečaci za pomicanje redaka prema gore i dolje
pl: Dodano skrót klawiszowy do przewijania linii w górę i w dół
pt_br: Adiciona atalhos de teclado para mover linhas para cima e para baixo
ru: Добавить сочетания клавиш для перемещения линий вверх и вниз

source: Highlight syntax for Git, Mercurial, and diffs
cs: Zvýrazňování syntaxe pro Git, Mercurial a diffy
et: Highlight syntax Git, Mercurial ja diff'idele
fr: Décorer les syntaxes Git, Mercurial et diffs
gl: Destaca sintaxe para Git, Mercurial e diffs
hi: Git, Mercurial और diffs के लिए सिंटैक्स को हाइलाइट करता है
hr: Ističe sintaksu za Git, Mercurial i razlike
pl: Podświetlanie syntax'u Gita, Mercuriala i diff'ów
ru: Синтаксис выделения для Git, Mercurial и diffs

source: Add a shortcuts window
cs: Přidáno okno klávesových zkratek
es: Añadir una ventana de atajos
et: Kiirklahvide aken lisatud
fr: Ajouts d'une fenêtre de raccourcis
gl: Engadir unha xanela de atallos
hi: शॉर्टकट विंडो जोड़ी गई
hr: Dodan prozor za prečace
pl: Dodano okno skrótów klawiszowych
pt_br: Adiciona uma janela de atalhos
ru: Добавлено окно ярлыков

source: Remove spell check temporarily
cs: Dočasné odstranění kontroly pravopisu
es: Elimina el corrector ortográfico temporalmente
et: Õigekirja kontrolli eemaldamine ajutiselt
fr: Désactiver temporairement la correction orthographique
gl: Eliminar verificación ortográfica temporalmente
hi: वर्तनी जांच अस्थायी रूप से हटा दी गई
hr: Privremeno uklonjena provjera pravopisa
pl: Usuń tymczasowo sprawdzanie pisowni
pt_br: Remove a verificação ortográfica temporariamente
ru: Временно удалить проверку орфографии

source: Support undo and redo
cs: Podpora pro akce zpět a znovu
es: Soporte para deshacer y rehacer
et: Undo ja redo tugi
fr: Support de l'historique d'annulation
gl: Soporta desfacer e refacer
hi: पूर्ववत और पुनः करें का समर्थन करता है
hr: Podrška za Poništi i Ponovi
pl: Obsługa cofania i ponawiania
pt_br: Suporte desfazer e refazer
ru: Поддержка отмены и повтора

source: Add symbolic icon
cs: Přidána symbolická ikona
es: Añade un icono simbólico
et: Sümboolne ikooni lisamine
fr: Ajout d'une icône symbolique
gl: Engadir icona simbólica
hi: प्रतीकात्मक चिह्न जोड़ा गया
hr: Dodana simbolička ikona
pl: Dodanie symbolicznej ikony
pt_br: Adiciona ícone simbólico
ru: Добавить символический значок

source: Add dark mode setting
cs: Přidané nastavení pro tmavý režim
es: Añade la configuración del modo oscuro
et: Tume teema sätte lisamine
fr: Ajout d'un paramètre pour le mode sombre
gl: Engadir configuración de modo escuro
hi: गहरे मोड की सेटिंग जोड़ी गई
hr: Dodana postavka za tamni modus
pl: Dodanie ustawienia trybu ciemnego
pt_br: Adiciona configuração de modo escuro
ru: Добавить настройку темного режима

source: Focus the text editor
cs: Automatické zaměření na textový editor
es: Enfoca el editor de texto
et: Teksti redigeerija fokuseerimine
fr: Donner le focus à l'éditeur de texte
gl: Enfocar o editor de texto
hi: टेक्स्ट एडिटर पर फोकस करता है
hr: Postavljanje uređivača teksta aktivnim
pl: Skoncentruj edytor tekstu
pt_br: Foca o editor de texto
ru: Фокусировка текстового редактора

source: Port to GTK 4 and libadwaita
cs: Portováno do GTK 4 a libadwaita
es: Adaptación a GTK 4 y libadwaita
et: GTK4 ja libadwaita uuendus
fr: Migration vers GTK4 et libadwaita
gl: Portar a GTK 4 e libadwaita
hi: GTK 4 और libadwaita में पोर्ट किया गया
hr: Program portiran za GTK 4 i libadwaita
pl: Przeniesienie do GTK4 i libadwaita
pt_br: Porte para GTK4 e libadwaita
ru: Перенос на GTK 4 и libadwaita

source: Move preferences to welcome window
cs: Předvolby přesunuty do uvítacího okna
es: Movidas las preferencias a la ventana de bienvenida
et: Eelistuste liigutamine avaaknale
fr: Déplacement des paramètres vers la fenêtre d'accueil
gl: Mover preferenzas a xanela de benvida
hi: प्राथमिकताओं को स्वागत विंडो में ले जाया गया
hr: Osobne postavke pomaknute u uvodni prozor
pl: Przeniesienie preferencji okna do okna powitalnego
pt_br: Move preferências para a janela de boas-vindas
ru: Перенесены настройки в окно приветствия

source: Only highlight text overflow on commits
cs: Zvýraznění pouze přetečení textu ve zprávách commitů
es: Sólo resalta el excedente de texto en las confirmaciones
et: Ainult näita teksti ületäitumist commit'ides
fr: Surligner uniquement le dépassement de texte pour les commits
gl: Só destacar o desbordamento de texto en remisións (commits)
hi: केवल कमिट पर टेक्स्ट ओवरफ़्लो को हाइलाइट करता है
hr: Ističe samo dio predugačkog teksta commit poruka
pl: Podświetlanie tylko przepełnienie tekstu w commitach
ru: Выделить только переполнение текста в коммитах

source: New app icon
cs: Nová ikona aplikace
es: Nuevo icono de la aplicación
et: Uus rakenduse ikoon
fr: Nouvelle icône de l'application
gl: Nova icona de aplicación
hi: नया ऐप आइकन
hr: Nova ikona programa
pl: Nowa ikonka aplikacji
pt_br: Novo ícone de aplicativo
ru: Новая иконка приложения

source: Remove double border
cs: Odstraněn dvojitý rámeček
es: Elimina el borde doble
et: Eemaldatud topelt ääris
fr: Supprimer la bordure double
gl: Borrar o doble borde
hi: डबल बॉर्डर हटा दिया गया
hr: Uklonjen dvostruki rub
pl: Usunięcie podwójnego obramowania
pt_br: Remove borda dupla
ru: Удалить двойную границу
