Repository: bragefuglseth/Commit
Catalog: po/*.po
Languages: cs, es, et, fr, gl, hi, hr, pl, pt_br, ru

source: Add a Preferences window
cs: Přidáno okno Předvolby
es: Añade una ventana de Preferencias
et: Lisatud eelistuste aken
fr: Ajouter une fenêtre de Préférences
gl: Engadir unha Xanela de preferenzas
hi: एक प्राथमिकताएँ विंडो जोड़ी गई
hr: Dodan prozor za osobne postavke
pl: Dodanie okna preferencji
pt_br: Adiciona uma janela de Preferências
ru: Добавлено окно настроек

source: Set default title length hint to 50 characters
cs: Nastavena výchozí délka titulku na 50 znaků
es: Establece la sugerencia de longitud del título por defecto a 50 caracteres
et: Vaikne pealkirja pikkuse soovitus 50 tähte
fr: Définir la longueur du titre par défaut à 50 caractères
gl: Establecer a lonxitude de título por defecto en 50 caracteres
hi: डिफ़ॉल्ट शीर्षक लंबाई संकेत को 50 वर्णों पर सेट करता है
hr: Postavljen savjet za duljinu naslova na 50 znakova
pl: Ustawienie domyślnej wskazówki długości tytułu na 50 znaków
pt_br: Define uma sugestão de comprimento padrão de título para 50 caracteres
ru: Длина заголовка по умолчанию установлена на 50 символов

source: Fix reading commits with special characters
cs: Opraveno čtení commitů se speciálními znaky
es: Corrige la lectura de confirmaciones con caracteres especiales
et: Vead commit'id eriliste märkidega parandatud
fr: Correction de la lecture de commits comprenant des caractères spéciaux
gl: Amañar a lectura de remisións con caracteres especiais
hi: विशेष वर्णों के साथ कमिट को पढ़ने को ठीक किया गया
hr: Ispravak čitanja commit poruka s posebnim znakovima
pl: Poprawka odczytywania commitów zawierających znaki specjalne
pt_br: Correção da leitura de commits com caracteres especiais
ru: Исправлено чтение коммитов со специальными символами

source: Fix git rebase not recognized
cs: Opraveno nerozpoznání git rebase
es: Corrige git rebase no reconocido
et: Tuvastamatu git rebase parandatud
fr: Correction de git rebase non reconnu
gl: Amañar git rebase non recoñecido
hi: Git रिबेस पहचाने नहीं जाने को ठीक किया गया
hr: Ispravak neprepoznavanja git rebase funkcije
pl: Poprawka git rebase not recognized
pt_br: Correção do git rebase não ser reconhecido
ru: Исправлено распознавание git rebase

source: Make windows bottom corners rounded
cs: Spodní rohy okna jsou zakulacené
es: Redondea las esquinas inferiores de las ventanas
et: Akna alumised nurgad tehtud ümaraks
fr: Arrondissement des coins inférieurs de la fenêtre
gl: Arredondar as esquinas do fondo das xanelas
hi: विंडो के निचले कोनों को गोलाकार बनाया
hr: Donji kutovi prozora zaobljeni
pl: Zaokrąglenie dolnych rogów okien
pt_br: Arredonda os cantos inferiores das janelas
ru: Нижние углы окон закруглены

source: Add 6px margin to editor
cs: Přidán 6px okraj do editoru
es: Añade un margen de 6px al editor
et: 6px margin lisatud redigeerijale
fr: Ajout d'une marge de 6px à l'éditeur
gl: Engador marxe de 6px ao editor
hi: संपादक में 6px मार्जिन जोड़ा गया
hr: Uređivaču dodan rub od 6 px
pl: Dodanie 6px marginesu do edytora
pt_br: Adiciona uma margem de 6px ao editor
ru: Добавлено поле 6px в редактор

source: Action required. After updating, please launch the application and follow the instructions.
cs: Je požadována akce. Po aktualizaci, prosím, spusťte aplikaci a postupujte podle pokynů.
et: Nõuab seadistamist. Pärast uuendamist, palun ava rakendus ning jälgi juhiseid.
hi: कार्रवाई आवश्यक है। अपडेट करने के बाद, कृपया एप्लिकेशन लॉन्च करें और निर्देशों का पालन करें।
hr: Zahtijeva radnju. Nakon aktualiziranja pokreni program i slijedi upute.
pl: Wymagane działanie. Po aktualizacji proszę uruchomić aplikacje i postępować zgodnie z instrukcjami.
ru: Необходимое действие. После обновления запустите приложение и следуйте инструкциям.

source: Show a welcome window when launched from desktop
cs: Zobrazení uvítacího okna při spuštění z plochy
es: Muestra una ventana de bienvenida cuando se lanza desde el escritorio
et: Avaakna näitamine, kui käivitatud töölauast
fr: Affiche une fenêtre de bienvenue lors du lancement depuis le bureau
gl: Mostrar unha xanela de benvida cando se inicie dende o escritorio
hi: डेस्कटॉप से लॉन्च होने पर एक स्वागत विंडो दिखाता है
hr: Prikaz uvodnog prozora kad se pokrene s radne površine
pl: Pokazywanie okna powitalnego przy uruchamianiu z pulpitu
pt_br: Mostra uma janela de boas-vindas ao iniciar da área de trabalho
ru: Теперь показывается окно приветствия при запуске с рабочего стола

source: Add support for Mercurial
cs: Přidána podpora pro Mercurial
es: Añade soporte para Mercurial
et: Mercurial tugi lisatud
fr: Ajout du support de Mercurial
gl: Engade soporte para Mercurial
hi: Mercurial के लिए समर्थन जोड़ता है
hr: Dodana podrška za Mercurial
pl: Dodanie obsługi dla Mercurial
pt_br: Adiciona suporte ao Mercurial
ru: Добавлена поддержка Mercurial

source: Remove filesystem permission
cs: Odebráno oprávnění souborového systému
es: Elimina el permiso del sistema de archivos
et: Failisüsteemi load eemaldatud
fr: Supprime la permission du système de fichiers
gl: Eliminar permiso de sistema de ficheiros
hi: फाइल सिस्टम अनुमति हटा दी गई
hr: Uklonjena dozvola za datotečni sustav
pl: Usunięcie uprawnień do systemu plików
pt_br: Remove permissão de sistema de arquivos
ru: Удалено разрешение файловой системы

source: Initial release. Forked from Gnomit 2.0.
cs: První vydání. Převzato z Gnomit 2.0.
es: Versión inicial. Bifurcado de Gnomit 2.0.
et: Esialgne väljaanne. Fork'itud Gnomit 2.0ist.
fr: Version initiale. Dérivé de Gnomit 2.0.
gl: Liberación inicial. Bifurcación de Gnomit 2.0.
hi: प्रारंभिक रिहाई। Gnomit 2.0 से फोर्क्ड।
hr: Prvo izdanje. Kopija od Gnomit 2.0.
pl: Wydanie początkowe. Rozwidlenie z Gnomit 2.0.
pt_br: Lançamento inicial. Feito fork do Gnomit 2.0.
ru: Первый выпуск. Ответвлено от Gnomit 2.0.

source: Support "#" in commit message
cs: Podpora "#" ve zprávách commitů
es: Soporte de "#" en el mensaje de confirmación
et: "#" tugi commit sõnumis
fr: Support de « # » dans le message de commit
gl: Soporta "#" en mensaxe de remisión/commit
hi: प्रतिबद्ध संदेश में "#" का समर्थन करता है
hr: Podrška za „#” u commit poruci
pl: Obsługa "#" w wiadomościach commit
pt_br: Suporte a “#” na mensagem de commit
ru: Добавлена поддержка "#" в сообщении коммита

source: Properly recognize executable path
cs: Správné rozpoznání cesty ke spustitelnému souboru
es: Reconoce correctamente la ruta del ejecutable
et: Õigesti tuvastab käivitaja asukoha
fr: Détection correcte du chemin vers l'exécutable
gl: Recoñece axeitadamente a rota do executable
hi: निष्पादन योग्य पथ को ठीक से पहचानता है
hr: Ispravno prepoznavanje staze do izvršne datoteke
pl: Prawidłowe rozpoznawanie ścieżki do pliku wykonywalnego
pt_br: Reconhece adequadamente o caminho do executável
ru: Правильно распознан исполняемый путь

source: translator-credits
cs: Vojtěch Perník <translations@pervoj.cz>
es: Óscar Fernández Díaz <oscfdezdz@tuta.io>
et: Henri https://hen.ee
fr: Thomas Citharel <gnome@tcit.fr> JeanDeLaMouche @JeanDeLaMouche
gl: 'Antonio Vega Cabanas <forza4+transCommit@gmail.com>'
hi: Scrambled777 <weblate.scrambled777@simplelogin.com>
hr: Milo Ivir <mail@milotype.de>
pl: realis <realiss@protonmail.com>
pt_br: Rafael Fontenelle <rafaelff@gnome.org>
ru: BigmenPixel https://github.com/BigmenPixel0

source: _Commit
hi: Commit (_C)

source: _Merge
hi: Merge (_M)
hr: S_jedini

source: _Tag
et: _Märgista
hi: टैग (_T)
hr: _Označi

source: A_dd
et: _Lisa
hi: जोड़ें (_d)
hr: _Dodaj

source: _Rebase
hi: Rebase (_R)
hr: _Presloži

source: _Save
et: _Salvesta
hi: सहेजें (_S)
hr: _Spremi
pl: _Zapisz

source: Editing
cs: Úpravy
es: Edición
et: Redigeerimine
fr: Modification de
gl: Edición
hi: संपादन
hr: Uređivanje
pl: Edycja
pt_br: Edição
ru: Редактирование

source: Save and confirm
cs: Uložit a potvrdit
es: Guardar y confirmar
et: Salvesta ja kinnita
fr: Sauvegarder et confirmer
gl: Gardar e confirmar
hi: सहेजें और पुष्टि करें
hr: Spremi i potvrdi
pl: Zapisz i potwierdź
pt_br: Salvar e confirmar
ru: Сохранить и подтвердить

source: Cancel and dismiss
cs: Zrušit a zavřít
es: Cancelar y descartar
et: Tühista
fr: Annuler et rejeter
gl: Cancelar e desestimar
hi: रद्द और खारिज करें
hr: Odustani i odbaci
pl: Anuluj i odrzuć
pt_br: Cancelar e dispensar
ru: Отмена и оставить

source: Open emoji chooser
cs: Otevřít výběr emotikonů
es: Abrir selector de emojis
et: Ava emoji menüü
fr: Ouvrir le sélecteur d'emoji
gl: Abrir selector emoji
hi: इमोजी चयनकर्ता खोलें
hr: Otvori birač emojija
pt_br: Abrir seletor de emojis
ru: Откройте средство выбора Эмодзи

source: Move current line up/down
cs: Přesunout současný řádek nahoru/dolů
es: Mover la línea actual hacia arriba/abajo
et: Liiguta käesolev rida üles/alla
fr: Déplacer la ligne actuelle vers le haut/bas
gl: Mover a liña actual arriba/abaixo
hi: वर्तमान लाइन को ऊपर/नीचे ले जाएँ
hr: Pomakni trenutačni redak gore/dolje
pt_br: Mover a linha atual para cima/para baixo
ru: Перемещение текущей строки вверх/вниз

source: Select All
cs: Vybrat vše
es: Seleccionar todo
et: Vali kõik
fr: Sélectionner tout
gl: Seleccionar Todo
hi: सभी चुनें
hr: Označi sve
pl: Zaznacz wszystko
pt_br: Selecionar tudo
ru: Выбрать все

source: Unelect All
cs: Zrušit výběr
es: Deseleccionar todo
et: Tühista valik
fr: Désélectionner tout
gl: Desseleccionar Todo
hi: सभी अचयनित करें
hr: Odznači sve
pl: Odznacz wszystko
ru: Отменить все

source: General
cs: Obecné
et: Üldine
fr: Général
gl: Xeral
hi: जनरल
hr: Opće
pl: Ogólne
pt_br: Geral
ru: Общее

source: Keyboard Shortcuts
cs: Klávesové zkratky
es: Atajos del teclado
et: Kiirklahvid
fr: Raccourcis clavier
gl: Atallos de Teclado
hi: कीबोर्ड शॉर्टकट
hr: Tipkovni prečaci
pl: Skróty klawiszowe
pt_br: Atalhos de teclado
ru: Горячие клавиши

source: Quit
cs: Ukončit
es: Salir
et: Lahku
fr: Quitter
gl: Saír
hi: छोड़ें
hr: Zatvori program
pl: Wyjdź
pt_br: Sair
ru: Выйти

source: _Abort
et: _Tühista
hi: निरस्त (_A)
hr: _Prekini
pl: _Porzuć

source: About Commit
cs: O Commitu
es: Acerca de Commit
et: Teave
fr: À propos de Commit
gl: Sobre Commit
hi: Commit के बारे में
hr: O programu Commit
pl: O Commit
pt_br: Sobre o Commit
ru: О приложении

source: Preferences
cs: Předvolby
es: Preferencias
et: Eelistused
fr: Préférences
gl: Preferenzas
hi: प्राथमिकताएँ
hr: Osobne postavke
pl: Preferencje
pt_br: Preferências
ru: Настройки

source: To set Commit as default editor for Git run the following command in Terminal
cs: Chcete-li nastavit Commit jako výchozí editor pro Git, spusťte v terminálu následující příkaz
es: Para establecer Commit como editor por defecto para Git ejecute el siguiente comando en Terminal
et: Et seadistada Commit Git'i vaikeredaktoriks, käivita antud käsk terminalis (konsoolis)
fr: Pour définir Commit en tant qu'éditeur par défaut pour Git, exécutez la commande ci-dessous dans Terminal
gl: Para establecer Commit como editor por defecto para Git, empregue o seguinte comando no Terminal
hi: Git के लिए Commit को डिफ़ॉल्ट संपादक के रूप में सेट करने के लिए टर्मिनल में निम्न कमांड चलाएँ
hr: Za postavljanje Commita kao standardnog uređivača za Git, pokreni sljedeću naredbu u terminalu
pl: Aby ustawić Commit jako domyślny edytor Git'a wykonaj następującą komendę w terminalu
pt_br: Para definir Commit como o editor padrão para Git, execute o seguinte comando no Terminal
ru: Чтобы установить Commit в качестве редактора по умолчанию для Git, выполните следующую команду в Терминале

source: Copy to Clipboard
cs: Zkopírovat do schránky
es: Copiar al portapapeles
et: Kopeeri lõikelauda
fr: Copier dans le presse-papiers
gl: Copiar a Portapapeis
hi: क्लिपबोर्ड पर कॉपी करें
hr: Kopiraj u međuspremnik
pl: Skopiuj do schowka
pt_br: Copiar para a área de transferência
ru: Скопировать в буфер обмена

source: Documentation
cs: Dokumentace
es: Documentación
et: Dokumentatsioon
gl: Documentación
hi: प्रलेखन
hr: Dokumentacija
pl: Dokumentacja
pt_br: Documentação
ru: Документация

source: To set Commit as default editor for Mercurial, set the following in your <tt>hgrc</tt>
cs: Chcete-li nastavit Commit jako výchozí editor pro Mercurial, nastavte následující ve svém <tt>hgrc</tt>
es: Para establecer Commit como editor por defecto para Mercurial, establezca lo siguiente en su <tt>hgrc</tt>
et: Et seadistada Commit Mercurial'i vaikeredaktoriks, lisa antud read <tt>hgrc</tt>'sse
fr: Pour définir Commit en tant qu'éditeur par défaut pour Mercurial, définissez la configuration ci-dessous dans votre <tt>hgrc</tt>
gl: Para establecer Commit como editor por defecto para Mercurial, establecer o seguinte no teu <tt>hgrc</tt>
hi: Mercurial के लिए Commit को डिफ़ॉल्ट संपादक के रूप में सेट करने के लिए, अपने <tt>hgrc</tt> में निम्नलिखित सेट करें
hr: Za postavljanje Commita kao standardnog uređivača za Mercurial, postavi sljedeće u svoj <tt>hgrc</tt>
pl: Aby ustawić Commit jako domyślny edytor dla Mercuriala, ustaw następujące ustawienia w twoim <tt>hgrc</tt>
pt_br: Para definir Commit como o editor padrão para Mercurial, defina o seguinte em seu <tt>hgrc</tt>
ru: Чтобы установить Commit в качестве редактора по умолчанию для Mercurial, установите следующее в вашем <tt>hgrc</tt>

source: Use dark mode
cs: Použít tmavý režim
es: Usar el modo oscuro
pt_br: Usar modo escuro

source: Tag
cs: Vytvořit štítek

source: Add
cs: Zařadit

source: Merge
cs: Spojit

source: Rebase
cs: Změnit základ

source: Save
cs: Uložit

source: Abort
cs: Přerušit
es: Cancelar
pt_br: Abortar

source: git;mercurial;hg;scm;gnomit;komet;comet;
ru: git;mercurial;hg;scm;gnomit;komet;

source: Commit
gl: Remitir (commit)

source: https://git-scm.com/book/en/v2/Customizing-Git-Git-Configuration#_core_editor
fr: https://git-scm.com/book/fr/v2/Personnalisation-de-Git-Configuration-de-Git#_core_editor
